---
kind: other
id: Properties.T:Autodesk.Revit.UI.Events.DialogBoxShowingEventArgs
source: html/acdb7cdd-a152-be89-5c47-b7dc67e6b3f6.htm
---
# DialogBoxShowingEventArgs Properties

Indicates whether an event may be cancelled by an event delegate.